import Head from "next/head";
import Link from "next/link";

const Privacy: React.FC = () => {
    return (
        <>
            <Head>
                <title>گنجور » شرایط استفاده و حریم خصوصی کاربران گنجور </title>
            </Head>
            <section className="py-4 md:py-8 text-justify">
                <h2 className="font-bold mb-2 md:mb-6 text-lg md:text-2xl">
                    شرایط استفاده و حریم خصوصی کاربران گنجور
                </h2>
                <p className="mb-2 md:mb-4">
                    در صورتی که تمایل دارید در گنجور حاشیه بگذارید، قطعات موسیقی مرتبط با اشعار را معرفی کنید، خوانش‌های خود را منتشر کنید، ویرایش‌های پیشنهادی خود از متن اشعار را ارائه کنید و به طور کلی هر گونه فعالیتی که موجب تغییراتی در گنجور شود انجام دهید می‌بایست در گنجور نام کاربری داشته باشید. قابلیت ثبت نام و ورود کاربران از ابتدای سال ۱۴۰۰ به گنجور اضافه شده است و پیش از آن بازدیدکنندگان می‌توانستند بدون ثبت نام روی اشعار گنجور حاشیه بنویسند. اما بعد از اضافه شدن این قابلیت، کاربرانی که با ایمیل ثبت شده در حاشیه‌هایشان در گنجور ثبت نام می‌کنند مالکیت آن حاشیه‌ها را هم در دست می‌گیرند (ثبت نام در گنجور بدون تأیید ایمیل امکان ندارد).
                </p>
                <p className="mb-2 md:mb-4">
                    گنجور در حالت عادی بازدیدهای کاربران و کلاً عملیاتی را که شامل مشاهدهٔ محتوا می‌شود به تفکیک کاربر ثبت نمی‌کند و بازدیدهای کاربران ثبت نام شده از صفحات سایت به طور خاص به نام آنها ثبت نمی‌شود. از این جهت بازدید صفحات سایت چه در حالتی که با نام کاربری وارد شده باشید و چه در حالت عادی از لحاظ جمع‌آوری آمار بازدیدها تفاوتی ندارد. گنجور برای جمع‌آوری آمار بازدیدها از سرویس گوگل آنالیتیکس استفاده می‌کند.
                </p>
                <p className="mb-2 md:mb-4">
                    تبصره: کاربران می‌توانند برای سهولت دسترسی به تاریخچهٔ بازدیدهایشان در گنجور، در پیشخان کاربری و در بخش «ادامهٔ مطالعه» ذخیرهٔ تاریخچهٔ بازدیدهایشان را فعال کنند. این قابلیت به طور پیش‌فرض غیرفعال است. با فعالسازی این قابلیت گنجور تاریخچهٔ بازدیدهای کاربر را برای استفادهٔ خود او و نه هیچ‌گونه استفادهٔ دیگری ذخیره می‌کند. ردیفهای تاریخچه به صورت تکی قابل حذف هستند و کاربر می‌تواند با توقف ذخیرهٔ تاریخچه از طریق همان مسیر کل تاریخچهٔ ذخیره شده را به یک باره پاک کند. به طور بدیهی با حذف کاربر این اطلاعات نیز پاک می‌شود و با ثبت‌نام مجدد با همان پست الکترونیکی مجدداً در دسترس قرار نمی‌گیرد.
                </p>
                <p className="mb-2 md:mb-4">
                    مهمترین اطلاعات خصوصی که برای ثبت نام نیاز است در اختیار گنجور قرار گیرد ایمیل کاربر است. گنجور اطلاعات دیگری را شامل نشانی آی‌پی اینترنتی کاربر و همینطور مشخصات مرورگر مورد استفادهٔ او در هنگام ورود و ثبت‌نام ذخیره می‌کند که این اطلاعات نیز خصوصی محسوب می‌شود و همانند ایمیل هیچگاه به طور عمومی منتشر نمی‌شود. گزارش (لاگ) هر گونه عملیاتی که منجر به تغییر در سایت گنجور شود (ایجاد، ویرایش و حذف اطلاعات) به همراه جزئیات نام کاربری و نشانی اینترنتی او برای ردگیری اشکالات فنی ذخیره می‌شود. این اطلاعات خصوصی نیز که کاربرد فنی و موقتی دارند به مرور و در بازه‌های زمانی مختلف حذف می‌شوند.
                </p>
                <p className="mb-2 md:mb-4">
                    کاربران گنجور مالک بخش عمده‌ای از اطلاعاتی هستند که به سایت اضافه می‌کنند. آنها می‌توانند هر زمان که اراده کنند حاشیه‌ها و خوانش‌های خود را حذف کنند. علاوه بر این بخشی از اطلاعات وارد شده توسط آنها که توسط کاربران دیگر به عنوان حاشیه‌های نامناسب یا ... گزارش شوند توسط کاربران دارای دسترسی بررسی محتوا حذف می‌شود. در صورتی که کاربری تصمیم بگیرد حساب کاربری خود را در گنجور حذف کند تمام حاشیه‌ها و خوانش‌های منتشر شده‌اش در گنجور نیز حذف خواهد شد. علاوه بر آن رکوردهای بخشهایی از مشارکت کاربر که در گنجور اثر غیر قابل حذف گذاشته است (مثل ویرایش متن اشعار یا پیشنهاد تصاویر مرتبط با اشعار) به حساب کاربری سیستمی گنجور منتقل می‌شود. عملیات حذف کاربر غیرقابل برگشت است و در صورتی که کاربر با ایمیلی که پیشتر در گنجور حساب کاربری داشته و آن را حذف کرده مجدداً ثبت نام کند هیچکدام از اطلاعات پیشتر وارد شده‌اش بر نخواهد گشت.
                </p>
                <p className="mb-2 md:mb-4">
                    حساب کاربرانی که قوانین مشارکت در گنجور (اعم از درج حاشیه‌ها و مانند آن) را به طور مکرر و عامدانه نقض کنند و اقدام به خرابکاری، توهین به کاربران و اشخاص دیگر، اشاعهٔ موضوعات و مباحث غیرادبی، بحث‌برانگیز و تفرقه‌انداز نمایند بدون اخطار قبلی حذف می‌شود.
                </p>
                <p className="mb-2 md:mb-4">
                    همچنان که در صفحهٔ&zwnj; <Link href="/about" target="_blank" className="text-sky-500"> معرفی گنجور </Link> ذکر شده است گنجور وابسته به هیچ سازمان خصوصی یا دولتی&zwnj;ای نیست و در فرایندهای مربوط به حفظ حریم خصوصی کاربران، شما -در حال حاضر- به اشخاصی بدون وابستگی به سازمان خاصی اعتماد کرده&zwnj;اید. گردانندگان گنجور حق اتمام فعالیت و پایان خدمات&zwnj;دهی آن را در مواردی که فعالیت آن به دلایل مختلف امکان&zwnj;پذیر نباشد برای خود محفوظ می&zwnj;دانند اما تلاش می&zwnj;کنند خروجی&zwnj;های عمومی مشارکت کاربران شامل اشعار تایپ شده و تصحیح شده را از طریق پروژه&zwnj;های بازمتن و وب&zwnj;سایتهای عمومی مخصوص این پروژه&zwnj;ها منتشر کنند.
                </p>
                <p className="mb-2 md:mb-4">
                    موتور اجرایی گنجور در قالب <Link href="https://github.com/ganjoor/GanjoorService" target="_blank" className="text-sky-500"> یک پروژهٔ بازمتن </Link> در دسترس است و موارد عنوان شده در مورد نحوهٔ جمع&zwnj;آوری اطلاعات گنجور با بررسی این کدها قابل تحقیق است.
                </p>
            </section>
        </>
    )
}

export default Privacy;